# SpaceComposednameParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceComposednameParam Property
ParameterTypeId Class See Also
---
"Composed Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceComposednameParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceComposednameParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceComposednameParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace